<div class="manualContent">

  <h2>Инструкция</h2>
  <p>Система контроля регистрации иностранных граждан делится на этапы: оформление приглашения на учебу, оформление временного пребывания, договор на обучение, оформление ордера на проживание, договор на проживание, приказ на заселение, регистрация, прохождение медосмотра, приказ о зачислении, ходатайство на временное  проживание, расположенные в шапке таблицы. За указанные этапы отвечают соответствующие подразделения.</p>
  <p>Доступ осуществляется посредством авторизации, для её успешного прохождения необходимо ввести свои логин и пароль.</p>
  <p>В системе разделены возможности подразделений, т.е. можно добавлять и/или редактировать свою часть информации. Списки иностранцев разделены по МФИУ, ФПДП, Ординатура, Аспирантура. Причем каждое из подразделений управляет своими списками, и имею свои архивы.</p>

  <ul id="functions">
      <li><a href="#search">Поиск по совпадению в ФИО (доступно всем)</a></li>
      <li><a href="#sort">Сортировка информации по определённым столбцам (доступно всем)</a></li>
      <li><a href="#add">Добавление/архивация записей (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#import">Импорт информации из csv файла (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#export">Экспорт информации в excel (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#editcountry">Редактирование страны (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#invitation">Оформление приглашения на учебу (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#residence">Оформление временного пребывания (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#education">Договор на обучение (доступно отдел договорных работ, Ординатура, Аспирантура)</a></li>
      <li><a href="#order">Оформление ордера на проживание (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#contract">Договор на проживание (доступно студенческий городок, Ординатура, Аспирантура)</a></li>
      <li><a href="#zaselenie">Приказ на заселение (доступно студенческий городок, Ординатура, Аспирантура)</a></li>
      <li><a href="#register">Регистрация (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#medical">Прохождение медосмотра (доступно ПЛКЦ, Ординатура, Аспирантура)</a></li>
      <li><a href="#prikaz">Приказ о зачислении (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#hostel">Ходатайство на временное  проживание (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#status">Редактирование статуса  (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#print">Печать ордера на проживание в общежитии (доступно МФИУ, ФПДП, Ординатура, Аспирантура)</a></li>
      <li><a href="#list">Просмотр списка (доступно всем)</a></li>
      <li><a href="#archiv">Просмотр архива (доступно всем)</a></li>
  </ul>
  
  <div class="examples"><a name="search"></a>
    <h3>Поиск по совпадению в ФИО</h3>
    <img class="manual-img" src="/images/foreigners/search.jpg" width="800" alt="поиск">
    <p>Поиск находится в правом верхнем углу. Он осуществляется посредством поиска введённого вами набора символов в ФИО иностранного гражданина, в результате чего вам показывается список совпадений, или пустая таблица (если совпадений не найдено). Смотрите рисунок выше.</p>
  </div>
  
  <div class="examples"><a name="sort"></a>
    <h3>Сортировка информации по определённым столбцам</h3>
    <img class="manual-img" src="/images/foreigners/sort.jpg" width="800" alt="сортировка">
    <p>Сортировать информацию можно по столбцам шапки таблицы, оформленным как ссылки. Столбцы: ФИО, страна, статус; при кликах сортируются по алфавиту в прямом и обратном порядках. Столбцы: оформление приглашения на учебу, оформление временного пребывания, договор на обучение, оформление ордера на проживание, договор на проживание, приказ на заселение, регистрация, прохождение медосмотра, приказ о зачислении, ходатайство на временное  проживание; при кликах сортируются по датам. На рисунке выше показан пример сортировки по стране.</p>
  </div>
  
  <div class="examples"><a name="add"></a>
    <h3>Добавление/архивация записей</h3>
    <img class="manual-img" src="/images/foreigners/add.jpg" width="800" alt="добавление/архивация записей">
    <p>На рисунке выше показаны кнопки для добавление/архивация записей, при клике на которые активируются соответствующие диалоговые окна (показанные на рисунках ниже). При добавлении вводим ФИО иностранца и нажимаем "Добавить", либо - "Отмена". При архивации записи нажимаем "Да", иначе - "Отмена".</p>
    <img src="/images/foreigners/add.png" alt="добавление"><br>
    <img src="/images/foreigners/delete.png" alt="архивация">
  </div>
  
  <div class="examples"><a name="import"></a>
    <h3>Импорт информации из csv файла</h3>
    <img class="manual-img" src="/images/foreigners/import.jpg" width="800" alt="импорт информации из csv файла">
    <p>На рисунке выше показана кнопка для вызова диалогового окна импорта информации из csv файла (показано на рисунке ниже). Для успешного импорта необходимо выбрать файл csv формата и нажать "Выполнить", иначе - "Отмена". Причем импортируется только 1-ый столбец файла, он должен содержать только ФИО иностранцев.</p>
    <img src="/images/foreigners/import.png" alt="импорт">
  </div>
  
  <div class="examples"><a name="export"></a>
    <h3>Экспорт информации в excel</h3>
    <img class="manual-img" src="images/foreigners/exprt.png" width="800" alt="экспорт информации в excel">
    <p>На рисунке выше показана кнопка экспорта информации в excel вместе с выпадающем меню из возможных вариантов, оформленных как ссылки.</p>
  </div>
  
  <div class="examples"><a name="editcountry"></a>
    <h3>Редактирование страны</h3>
    <img class="manual-img" src="/images/foreigners/country.jpg" width="800" alt="редактирование страны">
    <p>На рисунке выше для "Джораева Марал" в ячейке "страна" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно изменения страны (показанное на рисунке ниже). Можно изменить название и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/country.png" alt="редактирование страны">
  </div>
  
  <div class="examples"><a name="invitation"></a>
    <h3>Оформление приглашения на учебу</h3>
    <img class="manual-img" src="/images/foreigners/invitation.jpg" width="800" alt="оформление приглашения на учебу">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Оформление приглашения на учебу" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/invitation.png" alt="оформление приглашения на учебу">
  </div>
  
  <div class="examples"><a name="residence"></a>
    <h3>Оформление временного пребывания</h3>
    <img class="manual-img" src="/images/foreigners/residence.jpg" width="800" alt="">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Оформление временного пребывания" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/pribivanie.png" alt="Оформление временного пребывания">
  </div>
  
  <div class="examples"><a name="education"></a>
    <h3>Договор на обучение</h3>
    <img class="manual-img" src="/images/foreigners/education.jpg" width="800" alt="Договор на обучение">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Договор на обучение" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/educationdialog.png" alt="Договор на обучение">
  </div>
  
  <div class="examples"><a name="order"></a>
    <h3>Оформление ордера на проживание</h3>
    <img class="manual-img" src="/images/foreigners/order.jpg" width="800" alt="Оформление ордера на проживание">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Оформление ордера на проживание" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/order.png" alt="Оформление ордера на проживание">
  </div>
  
  <div class="examples"><a name="contract"></a>
    <h3>Договор на проживание</h3>
    <img class="manual-img" src="/images/foreigners/dprojivanie.jpg" width="800" alt="Договор на проживание">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Договор на проживание" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/contract.jpg" alt="Договор на проживание">
  </div>
  
  <div class="examples"><a name="zaselenie"></a>
    <h3>Приказ на заселение</h3>
    <img class="manual-img" src="/images/foreigners/prikaz.jpg" width="800" alt="Приказ на заселение">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Приказ на заселение" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/zaselenie.jpg" alt="Приказ на заселение">
  </div>
  
  <div class="examples"><a name="register"></a>
    <h3>Регистрация</h3>
    <img class="manual-img" src="/images/foreigners/register.jpg" width="800" alt="Регистрация">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Регистрация" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/rigistrat.png" alt="Регистрация">
  </div>
  
  <div class="examples"><a name="medical"></a>
    <h3>Прохождение медосмотра</h3>
    <img class="manual-img" src="/images/foreigners/plkc.jpg" width="800" alt="Прохождение медосмотра">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Прохождение медосмотра" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/medical.jpg" alt="Прохождение медосмотра">
  </div>
  
  <div class="examples"><a name="prikaz"></a>
    <h3>Приказ о зачислении</h3>
    <img class="manual-img" src="/images/foreigners/pzachisl.jpg" width="800" alt="Приказ о зачислении">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Приказ о зачислении" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/zachisl.png" alt="Приказ о зачислении">
  </div>
  
  <div class="examples"><a name="hostel"></a>
    <h3>Ходатайство на временное  проживание</h3>
    <img class="manual-img" src="/images/foreigners/hostel.jpg" width="800" alt="Ходатайство на временное  проживание">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Ходатайство на временное  проживание" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/hodataisvo.png" alt="Ходатайство на временное  проживание">
  </div>
  
  <div class="examples"><a name="status"></a>
    <h3>Редактирование статуса</h3>
    <img class="manual-img" src="/images/foreigners/status.jpg" width="800" alt="Редактирование статуса">
    <p>На рисунке выше для "Джораева Марал" в ячейке "Редактирование статуса" находится значение, подчеркнутое пунктирной линией, при клике на которое, вызывается диалоговое окно редактирования данного этапа (показанное на рисунке ниже). Можно изменить данные и нажать "Сохранить", либо отменить действие, нажав "Отмена".</p>
    <img src="/images/foreigners/status.png" alt="Редактирование статуса">
  </div>
  
  <div class="examples"><a name="print"></a>
    <h3>Печать ордера на проживание в общежитии</h3>
    <img class="manual-img" src="/images/foreigners/print.jpg" width="800" alt="Печать ордера на проживание в общежитии">
    <p>На рисунке выше для "Джораева Марал" после ячейки "Редактирование статуса" находится "изображение принтера", при клике на которое, вызывается диалоговое окно распечатки соответствующего ордера (показанное на рисунке ниже).</p>
    <img src="/images/foreigners/print.png" alt="Печать ордера на проживание в общежитии">
  </div>
  
  <div class="examples"><a name="list"></a>
    <h3>Просмотр списка</h3>
    <img class="manual-img" src="/images/foreigners/list.jpg" width="800" alt="Просмотр списка">
    <p>На рисунке выше показана ссылка "Список", при клике на которую, загружается список актуальных на данный момент записей, т.е. не архивных.</p>
  </div>
  
  <div class="examples"><a name="archiv"></a>
    <h3>Просмотр архива</h3>
    <img class="manual-img" src="/images/foreigners/archiv.png" width="800" alt="Просмотр архива">
    <p>На рисунке выше показана ссылка "Архив", при клике на которую, загружается архив записей, которые уже не актуальны. В архиве нельзя производить никаких действий с данными, они доступны только для просмотра.</p>
  </div>
  

</div>